[
  {
    "title": "The Gaza ceasefire isn’t broken",
    "link": "https://www.spectator.co.uk/article/the-gaza-ceasefire-isnt-broken-but-it-is-a-new-beginning/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2241698142-e1760887756353.jpg?h=293px&crop=0,0,440px,293px",
    "description": "The ceasefire in Gaza, barely settled just six days ago, has already been tested. Hamas was accused of violating the deal by firing rocket-propelled grenades and sniper fire at Israeli forces while the US warned the terror group was planning an ‘imminent’ attack on Palestinian civilians. In response, Israel struck a wave of targets within",
    "date": "19 Oct 2025"
  },
  {
    "title": "Thank God for Donald Trump",
    "link": "https://www.spectator.co.uk/article/thank-god-for-donald-trump/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2240432293.jpg?w=440px&crop=0,2,440px,293px",
    "description": "Imagine, for a moment, the world we narrowly escaped. A world in which Joe Biden, frail and fading, remained in the 2024 presidential race and, with the exhausted assent of a compliant media and a protective establishment, was returned to the White House. A world in which his decisive televised collapse never quite happened or",
    "date": "14 Oct 2025"
  },
  {
    "title": "The relief, joy and grief of Israel’s hostage homecoming",
    "link": "https://www.spectator.co.uk/article/the-relief-joy-and-grief-of-israels-hostages-homecoming/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2240363039.jpg?resize=440,293",
    "description": "This morning in Israel began like no other: layered, dissonant, momentous. A collision of spectacle and salvation, of grief and hope, of noise and meaning. It was a morning composed of many parts: part show, part hope, part illusion, part bluster, part redemption, part commercial deal, part peace plan, part threat, part diplomacy, part war.",
    "date": "13 Oct 2025"
  },
  {
    "title": "The real Gaza deal unfolds in the next 72 hours",
    "link": "https://www.spectator.co.uk/article/the-real-gaza-deal-unfolds-in-the-next-72-hours/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2239541117.jpg?resize=440,293",
    "description": "The machine is beginning to turn. The ceasefire agreed between Israel and Hamas, brokered with the direct involvement of President Trump, his envoy Steve Witkoff, and adviser Jared Kushner, has now formally taken effect. Hostages are not yet returned, but the mechanism for their release is in place. According to the agreement, Hamas must release",
    "date": "10 Oct 2025"
  },
  {
    "title": "Can Trump’s Gaza peace deal last?",
    "link": "https://www.spectator.co.uk/article/can-trumps-gaza-peace-deal-last/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2238077141.jpg?h=293px&crop=1,0,440px,293px",
    "description": "There is no office more burdened by impossible choices than that of the Israeli prime minister. When Benjamin Netanyahu steps into the cabinet room today to present the Gaza ceasefire deal, he does so not as a tactician manoeuvring for political points, but as a statesman carrying the unbearable weight of a people’s pain, fear,",
    "date": "9 Oct 2025"
  },
  {
    "title": "The Manchester synagogue attack didn’t come from nowhere",
    "link": "https://www.spectator.co.uk/article/the-manchester-synagogue-attack-didnt-come-from-nowhere/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2238321587.jpg?resize=440,293",
    "description": "It is still early in the investigation, and key details remain unconfirmed. But what is already known about this morning’s attack in Manchester is horrifying. At least two people are dead, as well as the attacker. Three others are in a ‘serious condition’. The attack occurred outside Heaton Park Hebrew Congregation Synagogue, shortly after 9.30",
    "date": "2 Oct 2025"
  },
  {
    "title": "Palestinians must regret rejecting Trump’s ‘Deal of the Century’",
    "link": "https://www.spectator.co.uk/article/palestinians-must-regret-rejecting-trumps-deal-of-the-century/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/10/GettyImages-2237772155.jpg?resize=440,293",
    "description": "In December 2024, Bill Clinton spoke with a candour that history affords. Reflecting on Camp David in 2000, he lamented that ‘you walk away from these once in a lifetime peace opportunities, and you can’t complain twenty-five years later when the doors weren’t all still open, and all the possibilities weren’t still there. You can’t",
    "date": "30 Sep 2025"
  },
  {
    "title": "Trump’s Gaza peace plan changes everything",
    "link": "https://www.spectator.co.uk/article/trumps-gaza-peace-plan-changes-everything/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2238077141.jpg?resize=440,293",
    "description": "In a moment of extraordinary geopolitical gravity, US President Donald Trump has unveiled a comprehensive plan to end the Gaza conflict – a proposal whose ambition, structure, and support represent a seismic shift in Middle Eastern diplomacy. But beneath its layered diplomacy lies a singular, inescapable truth: Trump is making it clear that Hamas must",
    "date": "22 Sep 2025"
  },
  {
    "title": "What will Keir Starmer’s Palestine declaration achieve?",
    "link": "https://www.spectator.co.uk/article/what-will-keir-starmers-palestine-declaration-achieve/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2235534655.jpg?resize=440,293",
    "description": "Keir Starmer has justified Britain’s declaration of Palestinian statehood by insisting that it will keep open the path to a two‑state solution and ultimately lead to peace. He has emphasised that Hamas could play no role in such a state, and seems to assume the move would position Britain as a key player in shaping",
    "date": "21 Sep 2025"
  },
  {
    "title": "Where is the outrage over the aid trucks hijacked in Gaza?",
    "link": "https://www.spectator.co.uk/article/where-is-the-outrage-over-the-aid-trucks-hijacked-in-gaza/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2230477768-e1758455688241.jpg?resize=440,293",
    "description": "Unicef has confirmed it in black and white: armed men in Gaza hijacked aid trucks at gunpoint, stealing ready-to-use therapeutic food meant for thousands of severely malnourished infants. According to the UN, at least 2,700 children have been deprived of life-saving nutrition as a result. And yet, the world barely blinked. When Israel takes military action, the",
    "date": "18 Sep 2025"
  },
  {
    "title": "Did Trump convince Starmer to see sense on Palestine?",
    "link": "https://www.spectator.co.uk/article/did-trump-convince-starmer-to-see-sense-on-palestine/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2236063069.jpg?resize=440,293",
    "description": "As Donald Trump visited the United Kingdom this week, the press seized the opportunity to confront both him and Keir Starmer about the issue of Hamas and Britain’s posture towards Palestinian statehood. In a rare moment of lucidity, and perhaps influenced by the firm presence of the current US president, Starmer appeared, briefly, to align",
    "date": "15 Sep 2025"
  },
  {
    "title": "The truth about the ‘Unite the Kingdom’ march",
    "link": "https://www.spectator.co.uk/article/the-truth-about-the-unite-the-kingdom-march/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2180395690.jpg?resize=440,293",
    "description": "On Saturday morning, I skipped synagogue and went to the Tommy Robinson march instead. By the time I arrived at Whitehall to collect my press pass for the Unite the Kingdom rally, the sun was shining and the stage was still being set up. I had optimistically planned to go straight to Shabbat prayers and",
    "date": "11 Sep 2025"
  },
  {
    "title": "Free speech should never be fatal",
    "link": "https://www.spectator.co.uk/article/free-speech-should-never-be-fatal/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2167287751.jpg?resize=440,293",
    "description": "Charlie Kirk was not storming a government building. He was not brandishing a weapon. He was not even shouting. He was on stage, mid-sentence, addressing a university audience at a speaking event. Then he was shot in the neck. And now he is dead. No civilised society can survive a situation in which public speech",
    "date": "9 Sep 2025"
  },
  {
    "title": "Israel is right to strike Hamas’s leaders in Qatar",
    "link": "https://www.spectator.co.uk/article/israels-doha-strikes-prove-it-is-a-regional-superpower/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2233744830.jpg?h=293px&crop=0,0,440px,293px",
    "description": "When the government of Qatar condemned the Israeli airstrike in Doha as a ‘cowardly’ act, it revealed less about the operation itself than about the priorities of the state voicing the charge. In reality, the strike was an extraordinary and unprecedented move: Israel launched a precision airstrike inside Qatari territory targeting senior Hamas leadership, aiming",
    "date": "8 Sep 2025"
  },
  {
    "title": "The Jerusalem massacre and the illusion of peace",
    "link": "https://www.spectator.co.uk/article/the-jerusalem-massacre-and-the-illusion-of-peace/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2233744559.jpg?resize=440,293",
    "description": "You can tell a great deal about countries and people by how they react to a horrific act of terror. And this morning’s massacre at the Ramot junction in Jerusalem came at a moment heavy with symbolism: just as the world was waking up to reports of Donald Trump floating a new plan for the",
    "date": "7 Sep 2025"
  },
  {
    "title": "Rabbi Sacks’s legacy shines brighter than ever",
    "link": "https://www.spectator.co.uk/article/rabbi-sackss-legacy-shines-brighter-than-ever/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-513276058-e1756724215245.jpg?resize=440,293",
    "description": "When King Charles paid tribute to Rabbi Lord Jonathan Sacks following his death in 2020, he called him ‘a light unto our nation’. It was a phrase that captured something profound and widely felt. Rabbi Sacks, who had served as Chief Rabbi of the United Hebrew Congregations of the Commonwealth from 1991 to 2013, was",
    "date": "1 Sep 2025"
  },
  {
    "title": "Hamas will struggle to recover from the elimination of Abu Ubaida",
    "link": "https://www.spectator.co.uk/article/hamas-will-struggle-to-recover-from-the-elimination-of-abu-ubaida/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/09/GettyImages-2215519071.jpg?resize=440,293",
    "description": "Despite its extraordinary discipline and repeated battlefield successes over the past two years, Israel has been judged in many quarters to have failed in one vital domain: the war of information. While Israel has neutralised enemy commanders, destroyed arsenals, and advanced through hostile territory, it has consistently been outflanked in the propaganda theatre, leading armchair",
    "date": "28 Aug 2025"
  },
  {
    "title": "Ed Davey’s pathetic Gaza boycott",
    "link": "https://www.spectator.co.uk/article/ed-daveys-pathetic-gaza-boycott/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2225406058-e1756373637554.jpg?resize=440,293",
    "description": "Ed Davey has built an entire political career on pratfalls, water slides and staged wipe-outs, like a children’s entertainer who accidentally wandered into Westminster. Paddleboarding into the lake, hurling himself down a slip ’n’ slide, spinning on teacups at Thorpe Park, he’s like one of those tragically comic idiot acts on Britain’s Got Talent, selected",
    "date": "22 Aug 2025"
  },
  {
    "title": "The BBC’s Israel problem needs investigating",
    "link": "https://www.spectator.co.uk/article/the-bbcs-israel-problem-needs-investigating/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2190261546-e1755850884441.jpg?resize=440,293",
    "description": "When the BBC was forced to admit that a woman it featured as a starving victim of the Gaza war was in fact also receiving treatment for cancer, it was not a minor correction. It was a collapse of credibility. The image of her wasted body, presented as evidence of Israeli starvation tactics, ricocheted across",
    "date": "21 Aug 2025"
  },
  {
    "title": "Hamas’s hostage deal is a catch-22 for Netanyahu",
    "link": "https://www.spectator.co.uk/article/hamass-new-hostage-deal-is-a-catch-22-for-netanyahu/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2229199403-e1755582807273.jpg?resize=440,293",
    "description": "The fragile negotiations between Israel and Hamas have once again entered a decisive phase, marked by the unveiling of a new ceasefire-hostage release proposal brokered by Egypt and Qatar. This proposal, which Hamas has reportedly accepted, includes notable shifts in its previous demands. Yet the core dilemma confronting the Israeli leadership remains unchanged: whether to",
    "date": "19 Aug 2025"
  },
  {
    "title": "Hamas is using Israel’s protests as a weapon of war",
    "link": "https://www.spectator.co.uk/article/hamas-is-using-israels-protests-as-a-weapon-of-war/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2229957700-e1755496631498.jpg?resize=440,293",
    "description": "Israel is caught in a tragic paradox: the finest qualities that define its national character – its compassion, solidarity, and moral responsibility – are exploited by adversaries who recognise in these virtues not strength, but vulnerability. As over half a million Israelis joined a nationwide strike yesterday, demanding a ceasefire and the return of hostages from",
    "date": "18 Aug 2025"
  },
  {
    "title": "The demonisation of Israeli ‘settlers’",
    "link": "https://www.spectator.co.uk/article/the-demonisation-of-israeli-settlers/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2227074379.jpg?resize=440,293",
    "description": "In the UK today, hold the wrong view and you’re cast as beyond the pale. Brexiteers are bigots. If you oppose mass immigration, you’re a far right racist. Among parts of the political class and commentariat, these labels are considered the consensus. The political and media establishment have crafted a narrative in which dissent from",
    "date": "10 Aug 2025"
  },
  {
    "title": "Will the occupation of Gaza allow Israel to crush Hamas?",
    "link": "https://www.spectator.co.uk/article/only-the-occupation-of-gaza-will-allow-israel-to-crush-hamas/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2228212179-e1754630670305.jpg?resize=440,293",
    "description": "In a decision of historic weight, the Israeli government has formally approved a plan to expand its military operation and establish full control over the Gaza Strip. This has come despite the opposition of Chief of Staff Eyal Zamir, who raised pointed warnings during a meeting that began at 6:00 pm Israeli time last night",
    "date": "8 Aug 2025"
  },
  {
    "title": "Israel’s plan to occupy Gaza is a last resort",
    "link": "https://www.spectator.co.uk/article/israels-plan-to-occupy-gaza-is-a-last-resort/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/08/GettyImages-2224131115-e1754371012994.jpg?resize=440,293",
    "description": "Reports last night from Israeli Channel 12 quoting a senior official in Prime Minister Benjamin Netanyahu’s office have confirmed what has long been rumoured, feared, and for some, awaited: the decision has been made to occupy the Gaza Strip. This is not yet formal policy, pending cabinet approval, but the trajectory is now unmistakable. The",
    "date": "5 Aug 2025"
  },
  {
    "title": "Starmer’s Palestine position is perverse",
    "link": "https://www.spectator.co.uk/article/starmers-palestine-policy-is-perverse/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-2226908390.jpg?h=293px&crop=0,0,440px,293px",
    "description": "Keir Starmer’s declaration that Britain will recognise a Palestinian state unless Israel takes ‘substantive steps’ to end the war in Gaza is, on its face, a symbolic diplomatic gesture. Yet symbols, particularly in international affairs, carry weight. And this one is a blow to Israel, both politically and strategically. The question is not whether this",
    "date": "30 Jul 2025"
  },
  {
    "title": "Why Israel is forced to sabotage itself",
    "link": "https://www.spectator.co.uk/article/why-israel-is-forced-to-sabotage-itself/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-2226633914.jpg?resize=440,293",
    "description": "Israel’s recently announced tactical pause in several sectors of Gaza, aimed at facilitating the distribution of humanitarian aid, is not merely a gesture of compassion under fire. It is a tactical adjustment born of necessity and certainly not a shift in moral posture. To understand this move properly is to grasp the complex interplay of",
    "date": "29 Jul 2025"
  },
  {
    "title": "The leaked email that blows apart the BBC’s impartiality claims over Gaza",
    "link": "https://www.spectator.co.uk/article/the-leaked-email-that-blows-apart-the-bbcs-impartiality-claims-over-gaza/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-1728035235-1.jpg?resize=440,293",
    "description": "A leaked internal email from a BBC executive editor reveals that the Corporation has issued prescriptive instructions to staff on how to cover the humanitarian situation in Gaza. The memo, titled ‘Covering the food crisis in Gaza’, amounts to a top-down editorial diktat that discards impartiality, elevates one side of a deeply contested narrative, and",
    "date": "28 Jul 2025"
  },
  {
    "title": "Will one final push by Israel destroy Hamas?",
    "link": "https://www.spectator.co.uk/article/israel-needs-one-final-push-to-destroy-hamas/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-2225398926-e1753177399633.jpg?resize=440,293",
    "description": "For more than 650 days of war in Gaza, one swathe of territory remained mostly untouched by Israeli ground manoeuvres: the dense, urban core of the central camps – Nuseirat, Deir al-Balah, Maghazi, and Bureij. That pattern has now decisively changed. On Sunday morning, the Israel Defence Forces (IDF) issued evacuation orders for southern Deir",
    "date": "22 Jul 2025"
  },
  {
    "title": "What’s happening in southern Syria – and why Israel is involved",
    "link": "https://www.spectator.co.uk/article/whats-happening-in-southern-syria-and-why-israel-is-involved/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-2221504300.jpg?resize=440,293",
    "description": "Over the last 24 hours, southern Syria has seen a sharp escalation in violence involving Syrian government forces, local Druze militias, and Israeli airpower. The developments centre on the city of As-Suwayda and the surrounding region, home to much of Syria’s Druze population, and have drawn renewed attention to the complex relationship between the Druze",
    "date": "16 Jul 2025"
  },
  {
    "title": "The BBC Gaza documentary report is a cover-up",
    "link": "https://www.spectator.co.uk/article/the-bbc-gaza-documentary-report-is-a-cover-up/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-481915006.jpg?resize=440,293",
    "description": "The BBC’s long-awaited editorial review of its documentary Gaza: How to Survive a Warzone was published today. It reads not like a rigorous investigation into serious journalistic failures, but like a desperate institutional whitewash. The report bends over backwards to defend the indefensible, trying to sanitise a catastrophic editorial misjudgment as little more than ‘a significant oversight",
    "date": "15 Jul 2025"
  },
  {
    "title": "Jewish doctors are sick of the BMA",
    "link": "https://www.spectator.co.uk/article/jewish-doctors-are-sick-of-the-bma/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-1481596444.jpg?resize=440,293",
    "description": "Around sixty Jewish doctors, including senior consultants and general practitioners, have left or are planning to leave the British Medical Association. Their decision is not a fleeting protest, but a serious response to what they consider to be a deeper institutional malaise that has gone untreated for too long. Many Jewish doctors feel their concerns have been",
    "date": "12 Jul 2025"
  },
  {
    "title": "Is Britain an ally or an enemy of Israel?",
    "link": "https://www.spectator.co.uk/article/is-britain-an-ally-or-an-enemy-of-israel/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-1730101810.jpg?resize=440,293",
    "description": "Even as the British parliament’s Intelligence and Security Committee (ISC) published its stark warning yesterday that the Islamic Republic of Iran’s Quds Force orchestrates spy rings on British soil, the UK continues its public ostracisation of Israel, the very country on the frontline of seeing down that exact threat. Britain must choose. Not between Israelis",
    "date": "11 Jul 2025"
  },
  {
    "title": "Grok’s praise for Hitler wasn’t a ‘glitch’",
    "link": "https://www.spectator.co.uk/article/groks-praise-for-hitler-wasnt-a-glitch/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/iStock-2204260446.jpg?h=293px&crop=0,0,440px,293px",
    "description": "We are deep into the AI boom – an age in which large language models have moved from novelty to necessity at a pace that has outstripped our capacity to reflect or adapt. There is breathless enthusiasm, endless hype and a sense that caution is for the timid and delay for the doomed. But sometimes, something",
    "date": "9 Jul 2025"
  },
  {
    "title": "Israel steps up its campaign to destroy the Houthis",
    "link": "https://www.spectator.co.uk/article/israels-campaign-to-destroy-the-houthis-has-intensified/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/GettyImages-2213934692-e1751865669651.jpg?resize=440,293",
    "description": "Last night, Israeli fighter jets struck multiple military targets belonging to the Houthi terrorist regime in Yemen, marking one of the most expansive and targeted responses to date. Among the sites hit were the ports of Al Hudaydah, Ras Isa, and Salif, as well as the Ras Kanatib power plant. The IDF confirmed that the",
    "date": "7 Jul 2025"
  },
  {
    "title": "Could Hebron join the Abraham Accords?",
    "link": "https://www.spectator.co.uk/article/could-hebron-join-the-abraham-accords/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/07/iStock-1447787322.jpg?h=293px&crop=0,0,440px,293px",
    "description": "You’ve heard of the two-state solution (or delusion, as I call it). But have you heard of the eight-state solution? Or the Palestinian Emirates plan? This is the idea of Professor Mordechai Kedar, who I spoke to in February 2024, just four months into the war started by the Palestinians on 7 October, 2023. If",
    "date": "6 Jul 2025"
  },
  {
    "title": "Who won the 12-day war?",
    "link": "https://www.spectator.co.uk/article/who-won-the-12-day-war/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2219259988.jpg?resize=440,293",
    "description": "As the dust settles from the United States and Israel’s sweeping strikes on the Islamic Republic regime’s nuclear infrastructure, a new battle has begun – one of narratives. Who really won? What damage was truly done? And what, precisely, has changed? The regime in Tehran claims resilience. Israel says deterrence has been re-established. Washington insists it achieved total",
    "date": "26 Jun 2025"
  },
  {
    "title": "Will Iran seize this moment for revolution?",
    "link": "https://www.spectator.co.uk/article/will-iran-seize-this-moment-for-revolution/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2220733774-e1750742876416.jpg?resize=440,293",
    "description": "Last night began with dramatic news: the Islamic Republic of Iran had launched a volley of ballistic missiles at the US-run Al Udeid airbase in Qatar, a retaliatory gesture following the devastating American strikes on the Iranian regime’s nuclear facilities. In Washington, President Trump entered the National Security Council, according to some reports accompanied by",
    "date": "24 Jun 2025"
  },
  {
    "title": "Israel is right to strike Evin prison",
    "link": "https://www.spectator.co.uk/article/israel-is-right-to-strike-evin-prison/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2151707761.jpg?resize=440,293",
    "description": "Israel announced today that it has launched an unprecedented strike against regime targets in central Tehran, including the notorious Evin prison. Evin is infamous for holding foreign hostages and dual nationals, many of whom are detained by the regime as part of what human rights groups call ‘hostage diplomacy’. It has long been associated with",
    "date": "23 Jun 2025"
  },
  {
    "title": "Trump’s Iran strike is a victory for the free world",
    "link": "https://www.spectator.co.uk/article/trumps-iran-strike-is-a-victory-for-the-free-world/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2220648268.jpg?resize=440,293",
    "description": "Tel Aviv To America and Israel, the free world owes a debt – for courage, for clarity, for doing what had to be done. When the moment came, they did not hesitate. They bore the weight, braved the cost, and moved with the strength history demands. When Israel first struck inside Iran nine days ago, its",
    "date": "22 Jun 2025"
  },
  {
    "title": "Trump’s two-week delay will unsettle Iran",
    "link": "https://www.spectator.co.uk/article/trumps-two-week-delay-will-unsettle-iran/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2220313126.jpg?h=293px&crop=0,0,440px,293px",
    "description": "In a statement relayed by press secretary Karoline Leavitt, the White House declared that President Donald Trump would decide ‘within the next two weeks’ whether to join Israel’s air campaign against Iran’s nuclear facilities. In isolation, it might seem a routine delay – an effort to keep diplomatic channels open, to stage manage an American entry",
    "date": "20 Jun 2025"
  },
  {
    "title": "Will Trump pull the trigger and strike Iran?",
    "link": "https://www.spectator.co.uk/article/will-trump-pull-the-trigger-and-strike-iran/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2219583326.jpg?resize=440,293",
    "description": "This morning’s sirens shattered the early calm across much of Israel. Quiet anticipation had already been building, as signs pointed to a long anticipated American entry into the conflict, but no one yet knows when, or if, it will truly come. It had been a relatively quiet night; after a brief stint in the bomb",
    "date": "19 Jun 2025"
  },
  {
    "title": "Israel will not be cowed by Iran",
    "link": "https://www.spectator.co.uk/article/israel-will-not-be-cowed-by-iran/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2219662971.jpg?resize=440,293",
    "description": "Yesterday morning, as families in central Israel emerged from bomb shelters after yet another sleepless night, the air was once again rent by sirens and the thunder of incoming missiles. Fires ignited across multiple cities. In Petah Tikva, a building lay smouldering from a direct hit. In Haifa, Iranian missiles struck near the port, severely",
    "date": "17 Jun 2025"
  },
  {
    "title": "The delusion of western Palestine activists in Egypt",
    "link": "https://www.spectator.co.uk/article/the-delusion-of-western-palestine-activists-in-egypt/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2219841457.jpg?resize=440,293",
    "description": "As the news cycle shifts its gaze to Iran and the escalating war to prevent the psychotic Islamic theocracy from going nuclear, spare a thought for the few hundred virtue-signalling westerners who thought it would be clever to traipse through Egypt and attempt to approach the Gaza border, armed not with aid or expertise, but",
    "date": "16 Jun 2025"
  },
  {
    "title": "The danger of recognising a Palestinian state",
    "link": "https://www.spectator.co.uk/article/the-danger-of-recognising-a-palestinian-state/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2173728463-e1749825431155.jpg?resize=440,293",
    "description": "As Western leaders prepare to gather in New York this week to discuss international recognition of a Palestinian state, a stark signal from Washington demands their attention. US Ambassador to Israel Mike Huckabee has openly stated that he does not believe Palestinian statehood remains an American foreign policy goal. ‘Unless there are some significant things",
    "date": "14 Jun 2025"
  },
  {
    "title": "Iranian rockets will not dim Israel’s resolve",
    "link": "https://www.spectator.co.uk/article/we-awake-to-a-new-israel/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2219304788.jpg?resize=440,293",
    "description": "Tel Aviv, Israel Israelis last night once again found themselves seeking shelter as the Islamic Revolutionary forces in Iran launched their long-anticipated retaliation for Israel’s 15-hour offensive against their nuclear and ballistic missile facilities. The Israeli strikes themselves had come as something of a surprise, not entirely unforeseen, but unexpected in their timing. Perhaps as",
    "date": "13 Jun 2025"
  },
  {
    "title": "Israel’s shadow war on Iran has burst into the open",
    "link": "https://www.spectator.co.uk/article/israels-shadow-war-on-iran-has-burst-into-the-open/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2219195402.jpg?resize=440,293",
    "description": "Woken by sirens outside my window in Israel at 3 a.m. I made my way to the bomb shelter in the basement, reaching for my phone on the way. An unusual and urgent message appeared on the screen which had been sent to the entire nation: Home Front Command had updated its guidelines with immediate",
    "date": "12 Jun 2025"
  },
  {
    "title": "Is Israel preparing to strike Iran?",
    "link": "https://www.spectator.co.uk/article/is-israel-preparing-to-strike-iran/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2210086498-1.jpg?resize=440,293",
    "description": "While much of the Western debate remains trapped in tired slogans and false moral narratives, events on the ground in the Middle East have taken a decisive turn. In the past 24 hours, U.S. embassies have begun evacuating non-essential staff. Military dependents are being authorised to leave key bases. Multiple reports say U.S. officials have",
    "date": "11 Jun 2025"
  },
  {
    "title": "Britain’s sanctioning of Israeli ministers is a grave mistake",
    "link": "https://www.spectator.co.uk/article/britains-sanctioning-of-israeli-ministers-is-a-grave-mistake/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-1244243548.jpg?resize=440,293",
    "description": "The United Kingdom’s decision this week to impose personal sanctions on two Israeli cabinet ministers, National Security Minister Itamar Ben-Gvir and Finance Minister Bezalel Smotrich, is a grave error – not only strategically, but morally. In concert with Canada, Australia, New Zealand, and Norway, Britain claims this move defends human rights and opposes settler violence.",
    "date": "10 Jun 2025"
  },
  {
    "title": "Is Hamas’s grip on Gaza weakening?",
    "link": "https://www.spectator.co.uk/article/hamas-is-losing-its-monopoly-on-gaza/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2200644124-e1749470323632.jpg?resize=440,293",
    "description": "The emergence of Yasser Abu Shabab and his ‘Popular Forces’ militia in eastern Rafah has become an unexpected fault line in the shifting landscape of Gaza. In recent days, a flurry of claims, counterclaims, and raw facts has begun to seep through the fog of war. Cracks are appearing in Hamas’s once unchallenged grip, and",
    "date": "9 Jun 2025"
  },
  {
    "title": "Greta Thunberg should thank Israel for intercepting her Gaza selfie ship",
    "link": "https://www.spectator.co.uk/article/greta-thunberg-should-thank-israel-for-intercepting-her-gaza-selfie-ship/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/Screenshot-2025-06-09-at-07.32.40.png?resize=440,293",
    "description": "Once again, the Mediterranean has hosted a familiar theatre of self-satisfied spectacle. This time, however, the curtain has come down swiftly. The latest vessel to set sail in defiance of Israel’s naval blockade of Gaza – the Madleen, a boat bloated with virtue signalling and the vanity of performative compassion – has been intercepted by",
    "date": "7 Jun 2025"
  },
  {
    "title": "Hamas doesn’t hold a monopoly on Palestinian terror",
    "link": "https://www.spectator.co.uk/article/hamas-doesnt-hold-a-monopoly-on-palestinian-terror/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-1782794921.jpg?resize=440,293",
    "description": "Israeli forces operating inside Gaza have retrieved the body of Thai agricultural worker Nattapong Pinta, bringing to a close one of the many grim and unresolved chapters from the October 7th atrocities. In a joint operation by the Shin Bet and the IDF, based on intelligence gleaned from captured militants, the body was recovered in",
    "date": "4 Jun 2025"
  },
  {
    "title": "What happened to Piers Morgan?",
    "link": "https://www.spectator.co.uk/article/what-happened-to-piers-morgan/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/Screenshot-2025-06-04-at-16.01.10.png?resize=440,293",
    "description": "There was great fanfare when Piers Morgan re-entered the world of television three years ago to front a new prime-time show on Rupert Murdoch’s TalkTV. Morgan framed the move as a fightback against cancel culture, a return to free speech, and a declaration of independence from the constraints of legacy media. Piers Morgan asks for",
    "date": "3 Jun 2025"
  },
  {
    "title": "When will the BBC admit it has an Israel problem?",
    "link": "https://www.spectator.co.uk/article/when-will-the-bbc-admit-it-has-an-israel-problem/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/iStock-1482609098.jpg?resize=440,293",
    "description": "When the White House uses a press briefing to lambast a foreign broadcaster by name, something seismic has shifted. That’s exactly what happened today when Donald Trump’s press secretary, Karoline Leavitt, publicly accused the BBC of treating ‘the word of Hamas as total truth’ and challenged the White House’s description of the broadcaster rushing out",
    "date": "2 Jun 2025"
  },
  {
    "title": "Jews in America are under attack",
    "link": "https://www.spectator.co.uk/article/jews-in-america-are-under-attack/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2217718852.jpg?resize=440,293",
    "description": "In Boulder, Colorado, eight elderly Jews were torched alive in a park. They wore red T-shirts bearing the names of hostages seized by Palestinian terrorists over 600 days earlier. Some carried Israeli flags. Walking peacefully in memory and solidarity, they were attacked with fire as a flamethrower and Molotov cocktails created flames as high as",
    "date": "31 May 2025"
  },
  {
    "title": "The rush to blame Israel is bad for journalism",
    "link": "https://www.spectator.co.uk/article/the-rush-to-blame-israel-is-bad-for-journalism/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2216765060.jpg?resize=440,293",
    "description": "If the war in Gaza has taught the world anything, it is this: truth in war is rarely immediate. In the fog of conflict, facts take time, evidence can be manipulated and early narratives are often weaponised. Yet time and again, much of the international media – and too many public officials – refuse to learn this",
    "date": "30 May 2025"
  },
  {
    "title": "Israel faces a brutal choice",
    "link": "https://www.spectator.co.uk/article/israel-faces-a-brutal-choice/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2215671225.jpg?resize=440,293",
    "description": "For months, Israel has faced a relentless barrage of criticism over its conduct in Gaza – from western governments, UN agencies, and media outlets that once claimed to be her allies. Central to the condemnation are the humanitarian circumstances: civilian suffering, limited aid access, and Israel’s temporary obstruction of some relief efforts. What has gone",
    "date": "27 May 2025"
  },
  {
    "title": "The case for looking back in anger",
    "link": "https://www.spectator.co.uk/article/the-case-for-looking-back-in-anger/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/Screen_Shot_2020-12-21_at_16.08.57.webp?h=293px&crop=11,0,440px,293px",
    "description": "Last week marked the anniversary of the Manchester Arena bombing – the deadliest terrorist attack on British soil since the 7/7 London bombings. Twenty-two people were murdered, most of them children and teenagers, at a pop concert targeted with deliberate cruelty. Among them was Saffie-Rose Roussos, just eight years old – the youngest known victim of terrorism",
    "date": "22 May 2025"
  },
  {
    "title": "Israel is prepared to go it alone in Gaza",
    "link": "https://www.spectator.co.uk/article/israel-is-prepared-to-go-it-alone-in-gaza/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2212028499-e1747807187954.jpg?resize=440,293",
    "description": "As Israel presses ahead with Operation Gideon’s Chariots, its most ambitious military campaign in Gaza since the war began, the political landscape surrounding the conflict is shifting – and not in Israel’s favour. Britain’s suspension of trade talks, the summoning of Israeli Ambassador Tzipi Hotovely, and coordinated statements of condemnation from the UK, France and",
    "date": "21 May 2025"
  },
  {
    "title": "What does Gary Lineker know about Zionism?",
    "link": "https://www.spectator.co.uk/article/gary-lineker-should-educate-himself-about-the-nazis/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2149445620_c0b864.jpg?resize=440,293",
    "description": "When I was a schoolboy, on the rare occasions I was required to line up against the wall to be picked for a football team, I would be picked last. It was fair enough: my abilities matched my interest level – zero. Not much has changed in the intervening decades, and thanks to my lack",
    "date": "16 May 2025"
  },
  {
    "title": "Palestine and the truth about the Nakba",
    "link": "https://www.spectator.co.uk/article/palestine-and-the-truth-about-the-nakba/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2153548324-e1746805365235.jpg?resize=440,293",
    "description": "The Nakba – Arabic for ‘the catastrophe’ and commemorated today – marks a profound moment of trauma in the Palestinian Arab consciousness. In 1948, following the Arab world’s rejection of the United Nations’ partition plan and their subsequent military assault on the fledgling State of Israel, around 700,000 Palestinians were displaced. While Israel accepted the",
    "date": "14 May 2025"
  },
  {
    "title": "The narcissism of Kanye West",
    "link": "https://www.spectator.co.uk/article/the-moral-corrosion-of-kanye-wests-heil-hitler-song/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-1205196725-e1746800167242.jpg?resize=440,293",
    "description": "We live in an age of liberation, in which we are told endlessly by some that freedom of speech, taken to its furthest boundaries, is the crowning achievement of democratic culture. And freedom of speech, alongside freedom of thought and conscience, freedom of (or from) religion, freedom of the press, of movement, of assembly and",
    "date": "9 May 2025"
  },
  {
    "title": "Tehran’s cruelty is closer than we think",
    "link": "https://www.spectator.co.uk/article/tehrans-cruelty-is-closer-than-we-think/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/Screenshot_5-5-2025_814_www.spectator.co_.uk_.jpeg?w=440px&crop=0,7,440px,293px",
    "description": "The arrest of eight men – seven of them Iranian nationals – across the United Kingdom in two separate counter-terrorism operations is a chilling reminder that the Islamic Republic of Iran is not a distant threat. It is here, embedded within our cities, probing the limits of our law, our patience and our willingness to defend",
    "date": "4 May 2025"
  },
  {
    "title": "Nike’s ‘Never again’ slogan is a disgrace",
    "link": "https://www.spectator.co.uk/article/nikes-never-again-slogan-is-a-disgrace/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-1324644047.jpg?resize=440,293",
    "description": "Fifty-six thousand runners completing the London Marathon yesterday may well have gasped the words ‘never again’ as they staggered across the finish line. I have never been a runner, but I imagine that even those who willingly endure the 26.2-mile ordeal must feel not only a profound sense of accomplishment but also, at the very",
    "date": "28 Apr 2025"
  },
  {
    "title": "Renewing the promise of ‘never again’",
    "link": "https://www.spectator.co.uk/article/renewing-the-promise-of-never-again/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/iStock-1987706733.jpg?resize=440,293",
    "description": "What does it mean to say ‘never again’? It is etched into memorials, inscribed in textbooks, whispered in the shadows of history’s darkest hour. It is a phrase uttered by world leaders at solemn ceremonies, by teachers guiding young minds through the horrors of the past, by those who stand in Auschwitz, tracing their fingers",
    "date": "24 Apr 2025"
  },
  {
    "title": "Parliament’s moral posturing on Israel is delusional",
    "link": "https://www.spectator.co.uk/article/parliaments-moral-posturing-on-israel-is-delusional/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-1715821719-e1745418024270.jpg?resize=440,293",
    "description": "What’s the point of parliament’s foreign affairs committee holding mock-trial style hearings about Israel’s defensive war against Iranian-backed terror groups? Do its members genuinely believe that such performative enquiries contribute to peace in the Middle East? One wonders how Britain might respond if the Israeli Knesset held public hearings into British issues – on Muslim",
    "date": "23 Apr 2025"
  },
  {
    "title": "Hamas is exploiting the freedoms it wants to destroy",
    "link": "https://www.spectator.co.uk/article/hamas-is-exploiting-the-freedoms-it-wants-to-destroy/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-1236562473.jpg?resize=440,293",
    "description": "In any sane world, it would be dismissed as grotesque fantasy: Hamas – the Iranian-backed terror group responsible for the 7 October massacre – petitioning British courts to lift its designation as a terrorist organisation. But this is one of those times it seems the entire world has gone mad.  For here we are, in",
    "date": "14 Apr 2025"
  },
  {
    "title": "Hamas has a history of using ambulances for war",
    "link": "https://www.spectator.co.uk/article/hamas-has-a-history-of-using-ambulances-for-war/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-2206568370.jpg?resize=440,293",
    "description": "Before the facts had even settled, western media outlets rendered their verdict: Israel was guilty. Guilty of deliberately targeting ambulances. Guilty of murdering humanitarian workers. Guilty because in the court of international opinion, Israel’s guilt is the default setting. Only later did the complicated reality emerge. Israeli forces near Rafah, acting on intelligence that Hamas",
    "date": "8 Apr 2025"
  },
  {
    "title": "Why did Israel block two British MPs at its border?",
    "link": "https://www.spectator.co.uk/article/why-did-israel-block-two-british-mps-at-its-border/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/Screenshot-2025-04-07-at-12.25.11.png?resize=440,293",
    "description": "In 2008, under the UK’s Labour government, Israeli politician Moshe Feiglin – a Likud central committee member – was denied entry into Britain. Then home secretary Jacqui Smith cited public safety concerns, quoting Feiglin’s provocative articles and speeches as justification. There was no court appeal available to him, no diplomatic immunity by virtue of his",
    "date": "7 Apr 2025"
  },
  {
    "title": "Sadiq Khan’s Eid message is a disgrace",
    "link": "https://www.spectator.co.uk/article/the-shame-of-sadiq-khans-eid-message/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-2178953483-e1743590540516.jpg?resize=440,293",
    "description": "London’s Muslim mayor Sadiq Khan published a video online earlier this week to mark the Muslim festival of Eid. Released under the guise of seasonal goodwill, this glib social media greeting is not merely problematic – it is an outright disgrace. Cloaked in the warm language of unity and peace, the Mayor of London delivered",
    "date": "2 Apr 2025"
  },
  {
    "title": "Why Israel is ramping up its war on terror",
    "link": "https://www.spectator.co.uk/article/why-israel-is-ramping-up-its-war-on-terror/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-2107852468.jpg?h=293px&crop=0,0,440px,293px",
    "description": "The war in Gaza has entered a more consequential and unforgiving phase. Early this morning, Palestinian sources reported that Israeli tanks had begun advancing into central Rafah, following a night of intense airstrikes across the southern Gaza Strip. This military escalation came after Israeli Defence Minister Israel Katz announced the expansion of Operation ‘Oz veCherev’",
    "date": "31 Mar 2025"
  },
  {
    "title": "The truth about the Gaza protests",
    "link": "https://www.spectator.co.uk/article/the-truth-about-the-gaza-protests/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-2206442983.jpg?resize=440,293",
    "description": "A series of striking videos have emerged from the Gaza Strip over the last week. Crowds of Palestinians, chanting slogans against Hamas, have taken to the streets in a rare public display of dissent. Some have criticised the mainstream Western media for treating these images with restraint, claiming a missed opportunity to spotlight what could",
    "date": "30 Mar 2025"
  },
  {
    "title": "The trouble with BBC Arabic",
    "link": "https://www.spectator.co.uk/article/we-need-an-inquiry-into-bbc-arabic/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-1503349936.jpg?resize=440,293",
    "description": "A peculiar incident occurred this month at an Israeli army base in the Negev: a wild caracal – a desert feline native to the region – bit two Israeli soldiers. Though minor and medically insignificant, the episode subsequently found its way across BBC Arabic’s platforms: X, Facebook, Instagram, and YouTube. Within a couple of days, the BBC had published",
    "date": "24 Mar 2025"
  },
  {
    "title": "Who will stand up for Jews today?",
    "link": "https://www.spectator.co.uk/article/who-will-stand-up-for-jews-today/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-2201452570.jpg?resize=440,293",
    "description": "Awoken by sirens wailing over large parts of central Israel last weekend, I pulled on whatever clothes I could find beside my bed and shuffled down to the bomb shelter in the basement. The missiles, launched from Yemen by the Iranian-backed Houthis, didn’t distinguish between ideologies or identities. More or less every Israeli in the strike",
    "date": "21 Mar 2025"
  },
  {
    "title": "Israel’s Gaza campaign is far from over",
    "link": "https://www.spectator.co.uk/article/israels-new-gaza-campaign-shows-no-signs-of-ending-soon/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-2205378573-e1742538240665.jpg?resize=440,293",
    "description": "The war in Gaza has resumed with a new intensity, but it would be a mistake to see this as a straightforward continuation of what we have witnessed over recent months. This phase of the conflict suggests a shift in strategy – one shaped by Israeli military recalculations, a more accommodating US administration, and the",
    "date": "18 Mar 2025"
  },
  {
    "title": "Israel has ‘opened the gates of hell’ in Gaza",
    "link": "https://www.spectator.co.uk/article/israels-war-with-hamas-is-entering-its-bloodiest-phase-yet/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-2205141618-e1742281708809.jpg?resize=440,293",
    "description": "In the early hours of Tuesday morning, Israel launched a surprise wave of strikes across the Gaza Strip, targeting key Hamas infrastructure and leadership. This escalation comes after Hamas repeatedly refused to release Israeli hostages under conditions proposed by Israel and backed by US mediators. Despite extensive negotiations, including direct involvement from Washington, Hamas chose",
    "date": "17 Mar 2025"
  },
  {
    "title": "Why couldn’t this elite school cope with my talk on anti-Semitism?",
    "link": "https://www.spectator.co.uk/article/why-couldnt-this-elite-school-cope-with-my-talk-on-antisemitism/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-1233500718.jpg?resize=440,293",
    "description": "Perhaps it is a rite of passage these days for a journalist to be cancelled. But I never expected that an elite school – one designed to create tomorrow’s international leaders, founded by a Jewish refugee from Nazi Germany – would be the ones to cancel a talk about anti-Semitism from me, the son of",
    "date": "14 Mar 2025"
  },
  {
    "title": "Why is the LSE hosting a Hamas book launch?",
    "link": "https://www.spectator.co.uk/article/why-is-the-lse-hosting-a-hamas-book-launch/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-2157427536.jpg?resize=440,293",
    "description": "The London School of Economics’ decision to host the launch this week of Understanding Hamas and Why That Matters – a book that attempts to sanitise and fails to properly condemn a terrorist organisation responsible for the worst massacre of Jews since the Holocaust – has rightly sparked outrage. It is a shameless attempt to rehabilitate",
    "date": "9 Mar 2025"
  },
  {
    "title": "Will Hamas take Trump’s Gaza ultimatum seriously?",
    "link": "https://www.spectator.co.uk/article/will-hamas-take-trumps-gaza-ultimatum-seriously/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/GettyImages-2203343853-e1741257482745.jpg?resize=440,293",
    "description": "‘“Shalom Hamas” means Hello and Goodbye – You can choose.’ So began Donald Trump’s furious social media post, an ultimatum wrapped in a linguistic dagger. The Hebrew word ‘shalom’ has a third meaning – peace – but Trump left that one out. Perhaps we can all agree: that option is no longer on the table in any outcome.",
    "date": "6 Mar 2025"
  },
  {
    "title": "No Other Land isn’t what it seems",
    "link": "https://www.spectator.co.uk/article/no-other-land-isnt-what-it-seems/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/03/Screenshot-2025-03-04-at-11.56.35.png?resize=440,293",
    "description": "The Oscars, an institution that claims to celebrate artistic excellence, this week played a leading role in a sophisticated and cynical propaganda campaign against Israel. The 2024 Academy Award for Best Documentary went to No Other Land, a film that, beneath the veneer of raw storytelling and supposed human rights advocacy, is little more than a",
    "date": "5 Mar 2025"
  },
  {
    "title": "The BBC’s reputation is in tatters after its Gaza debacle",
    "link": "https://www.spectator.co.uk/article/the-bbc-cant-brush-aside-its-gaza-documentary-disgrace/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/iStock-2183654202.jpg?resize=440,293",
    "description": "The BBC’s admission of serious editorial failures in its documentary Gaza: How to Survive a Warzone is not just a scandal – it is a moment of reckoning. This is, without doubt, one of the most humiliating debacles in the corporation’s modern history, and it vindicates those who have long highlighted the BBC’s institutional biases when reporting on",
    "date": "28 Feb 2025"
  },
  {
    "title": "The true meaning of Trump’s AI Gaza video",
    "link": "https://www.spectator.co.uk/article/the-true-meaning-of-trumps-ai-gaza-video/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/Screenshot-2025-02-27-at-14.55.04-1.png?w=440px&crop=0,3,440px,293px",
    "description": "Donald Trump’s AI-generated vision of Gaza – complete with golden statues of himself, bearded belly dancers, and a triumphant song declaring, ‘Trump Gaza, number one!’ – landed like a slap across the face of polite Western discourse. The reactions were swift and predictable. Outraged commentators called it tasteless, delusional, the fever dream of a man obsessed",
    "date": "27 Feb 2025"
  },
  {
    "title": "Who is responsible for the BBC’s Gaza documentary debacle?",
    "link": "https://www.spectator.co.uk/article/who-is-responsible-for-the-bbcs-gaza-documentary-debacle/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-1530919866.jpg?h=293px&crop=0,0,440px,293px",
    "description": "In 2007, the BBC was engulfed in scandal for an embarrassing – if relatively trivial – misrepresentation of Queen Elizabeth II. A promotional clip for a documentary, A Year with the Queen, was edited to suggest the monarch stormed out of a photoshoot in a huff, when in reality, the sequence had been misleadingly spliced together.",
    "date": "22 Feb 2025"
  },
  {
    "title": "The BBC’s Gaza documentary omitted something astonishing",
    "link": "https://www.spectator.co.uk/article/the-bbcs-gaza-documentary-omitted-something-astonishing/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-2199744390.jpg?resize=440,293",
    "description": "The BBC’s documentary Gaza: How to Survive a Warzone at first glance seemed to offer a raw and intimate portrayal of life in Gaza amid the ongoing conflict. However, the programme, which aired on BBC Two on Monday, was deeply flawed. The documentary, narrated by a Palestinian child, Abdullah Ayman Eliyazouri, presented a personal account of the",
    "date": "19 Feb 2025"
  },
  {
    "title": "Why do Australian doctors want to kill Israeli patients?",
    "link": "https://www.spectator.co.uk/article/why-do-australian-doctors-want-to-kill-israeli-patients/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-1715101916.jpg?resize=440,293",
    "description": "Imagine the uproar if a white Christian doctor refused to treat a Muslim Arab patient – or worse, boasted of killing them under their care. The public would be outraged, not only at the cruelty but at the sheer incongruity of such malice from a profession defined by care and a faith defined by compassion.",
    "date": "17 Feb 2025"
  },
  {
    "title": "The Middle East’s language wars",
    "link": "https://www.spectator.co.uk/article/the-middle-easts-language-wars/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-2197133370.jpg?resize=440,293",
    "description": "When the Middle East gets me down, I sometimes rewatch the video of Donald Trump announcing the death of ISIS leader ‘Abooo… Bakarrrr… al-Baghdadi’ in 2019. It never fails to make me laugh when Donald declares the terrorist leader ‘died like a dog… a beautiful dog’. It’s funny to many in the West, because Trump’s",
    "date": "15 Feb 2025"
  },
  {
    "title": "Why does Louis Theroux keep picking on Israeli settlers?",
    "link": "https://www.spectator.co.uk/article/why-does-louis-theroux-keep-picking-on-israeli-settlers/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/Screenshot-2025-02-12-at-16.41.35.png?resize=440,293",
    "description": "When is Louis Theroux going to make a documentary where he embeds himself with Hamas in Gaza? Or Palestinian Islamic Jihad in Jenin, Nablus, Tulkarm, or Qalqilya? Probably never, because he’d most likely come to a sticky end. His attempt to make a show about British Muslims who were sympathetic to Isis “fizzled out” Instead, Theroux is",
    "date": "14 Feb 2025"
  },
  {
    "title": "Trump has backed Hamas into a corner",
    "link": "https://www.spectator.co.uk/article/trump-has-backed-hamas-into-a-corner/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-2198395626-e1739341537903.jpg?resize=440,293",
    "description": "Donald Trump’s second meeting with a Middle Eastern leader in the Oval Office – this time with King Abdullah of Jordan – was even more striking than his first with Israeli Prime Minister Benjamin Netanyahu. If last week’s encounter signalled a seismic shift in US Middle East policy, yesterday’s developments confirmed it: the balance of",
    "date": "12 Feb 2025"
  },
  {
    "title": "How Hamas used starvation as a weapon of war",
    "link": "https://www.spectator.co.uk/article/how-hamas-used-starvation-as-a-weapon-of-war-against-israeli-hostages/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-2197827993.jpg?resize=440,293",
    "description": "We asked for proof of deliberate starvation in Gaza. On Saturday, we received it. The images of Eli Sharabi, Or Levy, and Ohad Ben Ami – three hostages released by Hamas after 491 days in captivity – were haunting. Frail, skeletal, barely able to stand, they bore the unmistakable marks of prolonged deprivation. The sight",
    "date": "10 Feb 2025"
  },
  {
    "title": "Can Hamas ever be defeated?",
    "link": "https://www.spectator.co.uk/article/can-hamas-ever-be-defeated/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-2196593089-e1738688502934.jpg?resize=440,293",
    "description": "No matter how many times it is vanquished or decisively discredited, ‘Palestinianism’ persists as an ideology unwilling to die. Rooted in Muslim Arab nationalism, it remains fundamentally opposed to the very existence of Israel – a Jewish, liberal, and free state. Hamas, one of its most notorious champions, has in recent weeks orchestrated a carefully",
    "date": "7 Feb 2025"
  },
  {
    "title": "The audacity of Trump’s Gaza plan",
    "link": "https://www.spectator.co.uk/article/the-audacity-of-trumps-gaza-plan/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/GettyImages-2196938705.jpg?resize=440,293",
    "description": "Some moments in history demand recognition, not just for their weight in the present but for the seismic shifts they herald. The Trump-Netanyahu press conference was one such moment – not a perfunctory diplomatic exercise, nor a routine reaffirmation of alliance, but an unambiguous declaration of intent. It was a disruption of long-entrenched, failed orthodoxies and",
    "date": "5 Feb 2025"
  },
  {
    "title": "Is it time to take Trump’s Gaza resettlement plan seriously?",
    "link": "https://www.spectator.co.uk/article/is-it-time-to-take-trumps-gaza-resettlement-plan-seriously/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/01/GettyImages-2195603567.jpg?resize=440,293",
    "description": "As Donald Trump toys with the audacious idea of relocating Gaza’s population – whether to neighbouring Jordan and Egypt, or even as far afield as Albania and Canada – he touches on one of history’s most contentious and emotionally charged issues: the relocation of peoples. Resettling large populations is never easy. History is full of",
    "date": "28 Jan 2025"
  },
  {
    "title": "There is no justice in the Gaza hostage deal",
    "link": "https://www.spectator.co.uk/article/there-is-no-justice-in-the-gaza-hostage-deal/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/01/GettyImages-2195530408-e1737989599801.jpg?resize=440,293",
    "description": "Imagine waking up to the news that Michael Adebolajo and Michael Adebowale, the brutal killers of British soldier Lee Rigby, were being released from prison. Picture the outrage as the British public remembers the images of Rigby being hacked to death on a Woolwich street in broad daylight, his killers unapologetic and defiant even during",
    "date": "27 Jan 2025"
  },
  {
    "title": "Can the ceasefire last?",
    "link": "https://www.spectator.co.uk/article/can-the-ceasefire-last/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/01/GettyImages-2194096962.jpg?resize=440,293",
    "description": "The ceasefire in Gaza, scheduled to begin this morning, has been anything but straightforward. As the agreement unfolds, many have rushed to declare who are the winners and who are the losers. Yet victory does not lie with those who made the most military gains or acted most morally – it leans, perversely, towards those ruthless enough",
    "date": "19 Jan 2025"
  },
  {
    "title": "Why Hamas keeps on celebrating",
    "link": "https://www.spectator.co.uk/article/why-hamas-keeps-celebrating/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/01/GettyImages-2193477032.jpg?resize=440,293",
    "description": "As plans for a ceasefire were announced on Wednesday night, videos of Gazans celebrating with glee made their way onto international news broadcasts. The celebrations were distinctive in style, and looked nothing like those of a people experiencing the end of a genocide. Many an anchor and analyst overlooked the detail, but we would all do well to",
    "date": "17 Jan 2025"
  },
  {
    "title": "This Israel-Hamas agreement defines an ‘uneasy peace’",
    "link": "https://www.spectator.co.uk/article/this-israel-hamas-agreement-defines-an-uneasy-peace/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/01/GettyImages-2193465916.jpg?resize=440,293",
    "description": "After 15 gruelling months of war and negotiation, a ceasefire and hostage release agreement between Israel and Hamas has been brokered, following intensive diplomatic activity led by the United States, Qatar,and Egypt. Announced this evening, the deal marks a critical yet deeply contentious milestone in the ongoing Israeli-Palestinian conflict. While it offers hope for the",
    "date": "15 Jan 2025"
  },
  {
    "title": "What price will Israel pay for a ceasefire with Hamas?",
    "link": "https://www.spectator.co.uk/article/what-price-will-israel-pay-for-a-ceasefire-with-hamas/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/01/GettyImages-2192837471.jpg?resize=440,293",
    "description": "As reports swirl of an imminent ceasefire agreement between Israel and Hamas, Israel stands at a crossroads, grappling with the profound dilemmas that such a deal entails. While the full details of the agreement remain unknown until officially announced, the fragments emerging suggest a complex and controversial arrangement that raises difficult questions: How much is",
    "date": "14 Jan 2025"
  },
  {
    "title": "Iran’s axis is dying",
    "link": "https://www.spectator.co.uk/article/irans-axis-is-dying/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/12/GettyImages-1217003935.jpg?resize=440,293",
    "description": "From the hilltop viewpoint at Misgav Am, Israel’s northernmost kibbutz in the Upper Galilee, the view into southern Lebanon is a panorama of uncertainty. Less than a full day after Assad was finally defeated in Syria, I stand at and look down at the rubble of the Lebanese buildings destroyed in the recent fighting, as",
    "date": "10 Dec 2024"
  },
  {
    "title": "The Oxford Union has disgraced itself",
    "link": "https://www.spectator.co.uk/article/the-oxford-union-has-disgraced-itself/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/12/B7F6GX.jpg?resize=440,293",
    "description": "The chamber of the Oxford Union, that once-proud institution, has been breached by the forces of bigotry, hatred, and mob rule. Invited to speak against an anti-Israel motion, I attended with three colleagues, each bringing unique expertise and experience to the room. But what unfolded on Thursday night was not a debate at all. It",
    "date": "2 Dec 2024"
  },
  {
    "title": "Amsterdam has failed its Jews",
    "link": "https://www.spectator.co.uk/article/amsterdam-has-failed-its-jews/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/11/GettyImages-2176504991-e1731052128916.jpg?resize=440,293",
    "description": "Last night in Amsterdam, a scene unfolded that should send shockwaves across Europe: hundreds of Jews were hunted and beaten by mobs following a football match between Maccabi Tel Aviv and Ajax. Whether a spontaneous flare-up or organised assault, terrified fans were forced to jump into the city’s canals to escape violence. At least ten",
    "date": "8 Nov 2024"
  },
  {
    "title": "Will Israel strike Iran again?",
    "link": "https://www.spectator.co.uk/article/is-this-the-start-of-a-new-wave-of-israeli-strikes-on-iran/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/10/GettyImages-2169352575-e1729929716950.jpg?resize=440,293",
    "description": "Israel’s major airstrike operation deep within Iranian territory last night was unprecedented, reportedly targeting over 20 military sites in a coordinated, multi-wave attack. For the first time, Israel not only conducted such a large-scale operation but also openly acknowledged it as it unfolded. According to Israeli sources, the operation achieved its objectives, dealing a decisive",
    "date": "26 Oct 2024"
  },
  {
    "title": "Benjamin Netanyahu has been vindicated",
    "link": "https://www.spectator.co.uk/article/benjamin-netanyahu-has-been-vindicated/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/10/GettyImages-2174917738.jpg?resize=440,293",
    "description": "The death of Yahya Sinwar, the top military commander of Hamas, is an important and symbolic moment in Israel’s ongoing war against the terror group. His elimination was finally made official by an evening statement from Prime Minister Benjamin Netanyahu, following hours of rumours fuelled by the circulation of unmistakable pictures of his corpse. Yet",
    "date": "18 Oct 2024"
  },
  {
    "title": "Can Lebanon ever be free of Hezbollah?",
    "link": "https://www.spectator.co.uk/article/can-lebanon-ever-be-free-of-hezbollah/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/10/GettyImages-2172940843-e1728888941973.jpg?resize=440,293",
    "description": "Lebanon is teetering on the edge of a seismic political shift, facing increasing pressure both from internal factions and external military threats. Years of dominance in Lebanon’s political and military arenas have not shielded the terror group Hezbollah from devastating external blows, including the assassination of its longtime leader, Hassan Nasrallah. The group’s entrenched power",
    "date": "14 Oct 2024"
  },
  {
    "title": "Israel’s triumphant response to 7 October",
    "link": "https://www.spectator.co.uk/article/israels-triumphant-response-to-7-october/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/10/GettyImages-1756513257.jpg?resize=440,293",
    "description": "One year after the brutal attacks of 7 October 2023, Israel’s global reputation has undergone a remarkable transformation. Far from being undermined by the actions it has taken in Gaza and beyond, Israel’s standing has been fortified, its image strengthened with steel. While some voices –particularly in the West – have feigned concern about Israel",
    "date": "7 Oct 2024"
  },
  {
    "title": "Could Iran target Jews outside Israel?",
    "link": "https://www.spectator.co.uk/article/could-iran-target-jews-outside-israel/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/10/GettyImages-2175351624.jpg?resize=440,293",
    "description": "After the massive direct Iranian attack on Israel, many breathed a sigh of relief that Israel’s defences were mostly well prepared and highly effective. The one death reported was that of a Gazan Palestinian man killed by shrapnel near Jericho. So much for Iranian solidarity with the Palestinians. Yet tensions remain high as further Iranian",
    "date": "3 Oct 2024"
  },
  {
    "title": "Why didn’t the BBC air this 7 October documentary earlier?",
    "link": "https://www.spectator.co.uk/article/why-didnt-the-bbc-air-this-october-7-documentary-earlier/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2024/09/Screenshot-2024-09-27-at-10.57.28.png?resize=440,293",
    "description": "We all know what happened on 7th October 2023. But those of us who have watched the Israeli government’s compilation of footage from the day, as well as other videos sourced from the darker corners of the internet, know more than most the extent of atrocities carried out by the Palestinian terrorists who invaded through",
    "date": "27 Sep 2024"
  },
  {
    "title": "Could this tree planting scheme bring down Israel’s prime minister?",
    "link": "https://www.spectator.co.uk/article/could-this-tree-planting-scheme-bring-down-israel-s-prime-minister/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2022/01/GettyImages-1237680009.jpg?resize=440,293",
    "description": "Planting trees is not usually a controversial activity, especially in the eco-conscious twenty-first century. But as ever, the rules are different where Israel is concerned, and government sanctioned forestation is currently threatening to tear apart the country’s delicately balanced coalition government. As is often the case in the region, the problem lies in competing claims",
    "date": "13 Jan 2022"
  },
  {
    "title": "HBO’s The Prince should leave George alone",
    "link": "https://www.spectator.co.uk/article/why-hbo-s-the-prince-doesn-t-work-as-satire/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/08/prince-george-queen-elizabeth_1.jpg?resize=440,293",
    "description": "Last year Netflix refused to add a disclaimer to the beginning of every episode of The Crown, warning viewers that it is part fiction. HBO Max’s new cartoon The Prince, however, had no choice: the series has been sitting on the shelf so long that it was out of date before it was even broadcast,",
    "date": "3 Aug 2021"
  },
  {
    "title": "Why Israel is rolling-out third vaccine doses",
    "link": "https://www.spectator.co.uk/article/why-israel-is-rolling-out-third-vaccine-doses/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/07/heath_israel_NO_WORDS.jpeg?resize=440,293",
    "description": "It’s time to think about your third Covid vaccine dose. That might sound like a premature suggestion when many people are still waiting for their second dose, and millions have not even received one. But Israel has just become the first place in the world to start giving a third, booster dose of the vaccine,",
    "date": "15 Jul 2021"
  },
  {
    "title": "What’s the real reason Israel’s vaccines were rejected by Palestinians?",
    "link": "https://www.spectator.co.uk/article/what-s-the-real-reason-israel-s-vaccines-were-rejected-by-palestinians/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/06/GettyImages-1232177843.jpg?resize=440,293",
    "description": "Sipping an iced coffee in a Tel Aviv café this week, it felt like it was 2018 again. Nobody wears a face mask, tables are close together and there’s no hand gel in sight. Very few people one meets even talk about Covid-19. Though a tiny increase in the occurrence of the Indian variant has been",
    "date": "21 Jun 2021"
  },
  {
    "title": "The disinformation war continues between Israel and Hamas",
    "link": "https://www.spectator.co.uk/article/the-disinformation-war-continues-between-israel-and-hamas/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/05/GettyImages-1233019010.jpg?resize=440,293",
    "description": "The ceasefire between Hamas and Israel has started, and the gates to Gaza have opened for the international press. Now a new battle will begin over numbers and ratios. There will be calls for investigations, and endless debates about who ‘won’. Israel’s claims of precision targeting will come under scrutiny, but so too should Palestinian",
    "date": "22 May 2021"
  },
  {
    "title": "Hamas’s rockets are killing Palestinians too",
    "link": "https://www.spectator.co.uk/article/hamas-s-rockets-are-killing-palestinians-too/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/05/GettyImages-1232914673.jpg?resize=440,293",
    "description": "Israel’s military action in Gaza is widely reported daily across the world. Images of hundreds of rockets lighting up the skies over Israeli cities and of the rubble of destroyed buildings in the Gaza Strip are once again part of the daily cycle of print and broadcast news. But most reports are thin on details",
    "date": "16 May 2021"
  },
  {
    "title": "What the fight against HIV can teach us about defeating Covid-19",
    "link": "https://www.spectator.co.uk/article/what-the-fight-against-hiv-can-teach-us-about-defeating-covid-19/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/04/GettyImages-1198900287.jpg?resize=440,293",
    "description": "In the eighties, we were warned to beware an easily spread, deadly virus. The government’s ominous HIV adverts told us not to ‘die of ignorance’. Thus a generation was educated through fear how to avoid infection by practicing safer sex and avoiding contact with the blood of those who are positive.  While those messages are",
    "date": "22 Apr 2021"
  },
  {
    "title": "How should we honour the ‘angels’ of the Holocaust when they’re gone?",
    "link": "https://www.spectator.co.uk/article/how-should-we-remember-the-angels-of-the-holocaust-when-they-re-gone/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/04/GettyImages-1232141636.jpg?resize=440,293",
    "description": "Yom HaShoa is Israel and the Jewish people’s day of remembrance for the Shoa, or Holocaust. It falls this year on 8th April. Its official Hebrew name means ‘Holocaust and Heroism Remembrance Day’, emphasising how we should remember not only the six million Jews who were killed by the Nazis, but also the heroes like",
    "date": "8 Apr 2021"
  },
  {
    "title": "The trouble with ‘BAME’",
    "link": "https://www.spectator.co.uk/article/the-problem-with-bame/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2021/02/GettyImages-1247055285.jpg?resize=440,293",
    "description": "Are Black people and Asians the same? Are they different from other ethnic minorities? What about Jews? And who do we include when we talk about Asians? Korean, Thai and Chinese people, or those from Afghanistan, Pakistan and India? Does ‘Asian’ refer to a set of skin colours or geographical locations? And what exactly is",
    "date": "27 Feb 2021"
  },
  {
    "title": "Should we judge Roald Dahl’s work by his anti-Semitism?",
    "link": "https://www.spectator.co.uk/article/should-we-judge-roald-dahl-s-work-by-his-appalling-anti-semitism/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2020/12/GettyImages-2638994.jpg?resize=440,293",
    "description": "Roald Dahl died in 1990. So why does it matter today that he was an anti-Semite? Why has his family apologised thirty years on? And should his work be cancelled as a result? Or, to paraphrase the bible, should the sins of the author be visited upon the third and fourth generations who profit from",
    "date": "7 Dec 2020"
  },
  {
    "title": "A Jewish view on lifting lockdown for Christmas",
    "link": "https://www.spectator.co.uk/article/a-jewish-view-on-lifting-lockdown-for-christmas/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2020/11/iStock-1272297724.jpg?resize=440,293",
    "description": "I never expected to become a fake Rabbi. But this year, on Yom Kippur of all days, it happened. In the middle of the Pandemic, Jews were faced with the problem of marking the holiest day of the year without being able to meet up even for prayer. Communal prayer is a central feature of",
    "date": "24 Nov 2020"
  }
]