[
  {
    "title": "Jews in America are under attack",
    "link": "https://www.spectator.co.uk/article/jews-in-america-are-under-attack/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2217718852.jpg?resize=440,293",
    "description": "In Boulder, Colorado, eight elderly Jews were torched alive in a park. They wore red T-shirts bearing the names of hostages seized by Palestinian terrorists over 600 days earlier. Some carried Israeli flags. Walking peacefully in memory and solidarity, they were attacked with fire as a flamethrower and Molotov cocktails created flames as high as",
    "date": "3 Jun 2025"
  },
  {
    "title": "The rush to blame Israel is bad for journalism",
    "link": "https://www.spectator.co.uk/article/the-rush-to-blame-israel-is-bad-for-journalism/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/06/GettyImages-2216765060.jpg?resize=440,293",
    "description": "If the war in Gaza has taught the world anything, it is this: truth in war is rarely immediate. In the fog of conflict, facts take time, evidence can be manipulated and early narratives are often weaponised. Yet time and again, much of the international media – and too many public officials – refuse to learn this",
    "date": "2 Jun 2025"
  },
  {
    "title": "Israel faces a brutal choice",
    "link": "https://www.spectator.co.uk/article/israel-faces-a-brutal-choice/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2215671225.jpg?resize=440,293",
    "description": "For months, Israel has faced a relentless barrage of criticism over its conduct in Gaza – from western governments, UN agencies, and media outlets that once claimed to be her allies. Central to the condemnation are the humanitarian circumstances: civilian suffering, limited aid access, and Israel’s temporary obstruction of some relief efforts. What has gone",
    "date": "31 May 2025"
  },
  {
    "title": "The case for looking back in anger",
    "link": "https://www.spectator.co.uk/article/the-case-for-looking-back-in-anger/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/Screen_Shot_2020-12-21_at_16.08.57.webp?h=293px&crop=11,0,440px,293px",
    "description": "Last week marked the anniversary of the Manchester Arena bombing – the deadliest terrorist attack on British soil since the 7/7 London bombings. Twenty-two people were murdered, most of them children and teenagers, at a pop concert targeted with deliberate cruelty. Among them was Saffie-Rose Roussos, just eight years old – the youngest known victim of terrorism",
    "date": "30 May 2025"
  },
  {
    "title": "Are British taxpayers funding Hamas?",
    "link": "https://www.spectator.co.uk/article/are-british-taxpayers-funding-hamas/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2214115123.jpg?resize=440,293",
    "description": "British taxpayer funds, earmarked for humanitarian aid in Gaza, may have passed through Hamas-controlled structures, according to a report on Israel’s Channel 12 over the weekend. The core of the allegation is not that the UK sought to support terrorism, but that its aid strategy operated in concert with the very machinery that sustains Hamas’s rule.",
    "date": "27 May 2025"
  },
  {
    "title": "The Washington shooting is a chilling warning to Jews everywhere",
    "link": "https://www.spectator.co.uk/article/the-washington-shooting-is-a-chilling-warning-to-jews-everywhere/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2215734612.jpg?resize=440,293",
    "description": "Waking early on Thursday in London, I read the news on a half-lit phone screen: two people, Israeli embassy staff, gunned down outside the Capital Jewish Museum in Washington D.C. A man shouted “Free Palestine,” – of course he did – after he had fired his weapon and walked inside the building – where, in",
    "date": "22 May 2025"
  },
  {
    "title": "Israel is prepared to go it alone in Gaza",
    "link": "https://www.spectator.co.uk/article/israel-is-prepared-to-go-it-alone-in-gaza/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2212028499-e1747807187954.jpg?resize=440,293",
    "description": "As Israel presses ahead with Operation Gideon’s Chariots, its most ambitious military campaign in Gaza since the war began, the political landscape surrounding the conflict is shifting – and not in Israel’s favour. Britain’s suspension of trade talks, the summoning of Israeli Ambassador Tzipi Hotovely, and coordinated statements of condemnation from the UK, France and",
    "date": "21 May 2025"
  },
  {
    "title": "What does Gary Lineker know about Zionism?",
    "link": "https://www.spectator.co.uk/article/gary-lineker-should-educate-himself-about-the-nazis/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2149445620_c0b864.jpg?resize=440,293",
    "description": "When I was a schoolboy, on the rare occasions I was required to line up against the wall to be picked for a football team, I would be picked last. It was fair enough: my abilities matched my interest level – zero. Not much has changed in the intervening decades, and thanks to my lack",
    "date": "16 May 2025"
  },
  {
    "title": "Palestine and the truth about the Nakba",
    "link": "https://www.spectator.co.uk/article/palestine-and-the-truth-about-the-nakba/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-2153548324-e1746805365235.jpg?resize=440,293",
    "description": "The Nakba – Arabic for ‘the catastrophe’ and commemorated today – marks a profound moment of trauma in the Palestinian Arab consciousness. In 1948, following the Arab world’s rejection of the United Nations’ partition plan and their subsequent military assault on the fledgling State of Israel, around 700,000 Palestinians were displaced. While Israel accepted the",
    "date": "14 May 2025"
  },
  {
    "title": "The narcissism of Kanye West",
    "link": "https://www.spectator.co.uk/article/the-moral-corrosion-of-kanye-wests-heil-hitler-song/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/GettyImages-1205196725-e1746800167242.jpg?resize=440,293",
    "description": "We live in an age of liberation, in which we are told endlessly by some that freedom of speech, taken to its furthest boundaries, is the crowning achievement of democratic culture. And freedom of speech, alongside freedom of thought and conscience, freedom of (or from) religion, freedom of the press, of movement, of assembly and",
    "date": "9 May 2025"
  },
  {
    "title": "Tehran’s cruelty is closer than we think",
    "link": "https://www.spectator.co.uk/article/tehrans-cruelty-is-closer-than-we-think/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/05/Screenshot_5-5-2025_814_www.spectator.co_.uk_.jpeg?w=440px&crop=0,7,440px,293px",
    "description": "The arrest of eight men – seven of them Iranian nationals – across the United Kingdom in two separate counter-terrorism operations is a chilling reminder that the Islamic Republic of Iran is not a distant threat. It is here, embedded within our cities, probing the limits of our law, our patience and our willingness to defend",
    "date": "4 May 2025"
  },
  {
    "title": "Nike’s ‘Never again’ slogan is a disgrace",
    "link": "https://www.spectator.co.uk/article/nikes-never-again-slogan-is-a-disgrace/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-1324644047.jpg?resize=440,293",
    "description": "Fifty-six thousand runners completing the London Marathon yesterday may well have gasped the words ‘never again’ as they staggered across the finish line. I have never been a runner, but I imagine that even those who willingly endure the 26.2-mile ordeal must feel not only a profound sense of accomplishment but also, at the very",
    "date": "28 Apr 2025"
  },
  {
    "title": "Renewing the promise of ‘never again’",
    "link": "https://www.spectator.co.uk/article/renewing-the-promise-of-never-again/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/02/iStock-1987706733.jpg?resize=440,293",
    "description": "What does it mean to say ‘never again’? It is etched into memorials, inscribed in textbooks, whispered in the shadows of history’s darkest hour. It is a phrase uttered by world leaders at solemn ceremonies, by teachers guiding young minds through the horrors of the past, by those who stand in Auschwitz, tracing their fingers",
    "date": "24 Apr 2025"
  },
  {
    "title": "Parliament’s moral posturing on Israel is delusional",
    "link": "https://www.spectator.co.uk/article/parliaments-moral-posturing-on-israel-is-delusional/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-1715821719-e1745418024270.jpg?resize=440,293",
    "description": "What’s the point of parliament’s foreign affairs committee holding mock-trial style hearings about Israel’s defensive war against Iranian-backed terror groups? Do its members genuinely believe that such performative enquiries contribute to peace in the Middle East? One wonders how Britain might respond if the Israeli Knesset held public hearings into British issues – on Muslim",
    "date": "23 Apr 2025"
  },
  {
    "title": "Hamas is exploiting the freedoms it wants to destroy",
    "link": "https://www.spectator.co.uk/article/hamas-is-exploiting-the-freedoms-it-wants-to-destroy/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-1236562473.jpg?resize=440,293",
    "description": "In any sane world, it would be dismissed as grotesque fantasy: Hamas – the Iranian-backed terror group responsible for the 7 October massacre – petitioning British courts to lift its designation as a terrorist organisation. But this is one of those times it seems the entire world has gone mad.  For here we are, in",
    "date": "14 Apr 2025"
  },
  {
    "title": "Hamas has a history of using ambulances for war",
    "link": "https://www.spectator.co.uk/article/hamas-has-a-history-of-using-ambulances-for-war/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-2206568370.jpg?resize=440,293",
    "description": "Before the facts had even settled, western media outlets rendered their verdict: Israel was guilty. Guilty of deliberately targeting ambulances. Guilty of murdering humanitarian workers. Guilty because in the court of international opinion, Israel’s guilt is the default setting. Only later did the complicated reality emerge. Israeli forces near Rafah, acting on intelligence that Hamas",
    "date": "8 Apr 2025"
  },
  {
    "title": "Why did Israel block two British MPs at its border?",
    "link": "https://www.spectator.co.uk/article/why-did-israel-block-two-british-mps-at-its-border/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/Screenshot-2025-04-07-at-12.25.11.png?resize=440,293",
    "description": "In 2008, under the UK’s Labour government, Israeli politician Moshe Feiglin – a Likud central committee member – was denied entry into Britain. Then home secretary Jacqui Smith cited public safety concerns, quoting Feiglin’s provocative articles and speeches as justification. There was no court appeal available to him, no diplomatic immunity by virtue of his",
    "date": "7 Apr 2025"
  },
  {
    "title": "Sadiq Khan’s Eid message is a disgrace",
    "link": "https://www.spectator.co.uk/article/the-shame-of-sadiq-khans-eid-message/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-2178953483-e1743590540516.jpg?resize=440,293",
    "description": "London’s Muslim mayor Sadiq Khan published a video online earlier this week to mark the Muslim festival of Eid. Released under the guise of seasonal goodwill, this glib social media greeting is not merely problematic – it is an outright disgrace. Cloaked in the warm language of unity and peace, the Mayor of London delivered",
    "date": "2 Apr 2025"
  },
  {
    "title": "Why Israel is ramping up its war on terror",
    "link": "https://www.spectator.co.uk/article/why-israel-is-ramping-up-its-war-on-terror/",
    "image": "https://www.spectator.co.uk/wp-content/uploads/2025/04/GettyImages-2107852468.jpg?h=293px&crop=0,0,440px,293px",
    "description": "The war in Gaza has entered a more consequential and unforgiving phase. Early this morning, Palestinian sources reported that Israeli tanks had begun advancing into central Rafah, following a night of intense airstrikes across the southern Gaza Strip. This military escalation came after Israeli Defence Minister Israel Katz announced the expansion of Operation ‘Oz veCherev’",
    "date": "31 Mar 2025"
  }
]